In [1]:
import pandas as pd

In [5]:
art_df = pd.read_csv('./data/all_data_info.csv')

In [9]:
art_df.head()

,artist,date,genre,pixelsx,pixelsy,size_bytes,source,style,title,artist_group,in_train,new_filename
0,Barnett Newman,1955.0,abstract,15530.0,6911.0,9201912.0,wikiart,Color Field Painting,Uriel,train_only,True,102257.jpg
1,Barnett Newman,1950.0,abstract,14559.0,6866.0,8867532.0,wikiart,Color Field Painting,Vir Heroicus Sublimis,train_only,True,75232.jpg
2,kiri nichol,2013.0,NaN,9003.0,9004.0,1756681.0,NaN,Neoplasticism,NaN,test_only,False,32145.jpg
3,kiri nichol,2013.0,NaN,9003.0,9004.0,1942046.0,NaN,Neoplasticism,NaN,test_only,False,20304.jpg
4,kiri nichol,2013.0,NaN,9003.0,9004.0,1526212.0,NaN,Neoplasticism,NaN,test_only,False,836.jpg

Empty DataFrame
Columns: [artist, date, genre, pixelsx, pixelsy, size_bytes, source, style, title, artist_group, in_train, new_filename]
Index: []

In [63]:
# 10643 bilder med impressionism
# 7000 bilder med Expressionism
# 4147 bilder med Surrealism

art_df[art_df['style'] == 'Surrealism']['style']

11        Surrealism
176       Surrealism
238       Surrealism
287       Surrealism
307       Surrealism
             ...
103220    Surrealism
103224    Surrealism
103229    Surrealism
103230    Surrealism
103247    Surrealism
Name: style, Length: 4167, dtype: object

In [77]:
# Hämtar ut alla bilder som finns i train_2-mappen

train_2 = art_df.loc[art_df['new_filename'].str.startswith('2')].sort_values("new_filename")[['style', 'new_filename']]

                         style new_filename
97500            Expressionism        2.jpg
66790       Mechanistic Cubism       20.jpg
45654            Impressionism      200.jpg
96518             Art Informel     2000.jpg
61576  Naïve Art (Primitivism)    20000.jpg

In [83]:
train_2.dropna(inplace=True)

In [67]:
# train_2 har 485 bilder med surrealism
# train_2 har 1164 bilder med Impressionism
# train_2 har 737 bilder med expressionism

# train_2[train_1['style'] == 'Expressionism']

               style new_filename
97500  Expressionism        2.jpg
88070  Expressionism    20006.jpg
10737  Expressionism    20023.jpg
97991  Expressionism    20031.jpg
74588  Expressionism    20071.jpg
...              ...          ...
89495  Expressionism    29948.jpg
65457  Expressionism    29952.jpg
61938  Expressionism    29963.jpg
17325  Expressionism    29982.jpg
93839  Expressionism    29995.jpg

[737 rows x 2 columns]

In [84]:
pd.to_pickle(train_2, 'art_subset_train_2.pkl')

In [115]:
test_df = pd.read_pickle('art_subset_train_2.pkl')

In [88]:
test_df.isna().sum()

style           0
new_filename    0
dtype: int64

In [114]:
test_df = test_df.astype(str)

AttributeError: 'function' object has no attribute 'astype'

In [116]:
test_df = test_df.reset_index()

In [117]:
test_df.head()

   index                    style new_filename
0  97500            Expressionism        2.jpg
1  66790       Mechanistic Cubism       20.jpg
2  45654            Impressionism      200.jpg
3  96518             Art Informel     2000.jpg
4  61576  Naïve Art (Primitivism)    20000.jpg

In [118]:
# resetat index
pd.to_pickle(train_2, 'art_subset_train_2.pkl')